Tekla Open API Reference for Tekla Structures 2025
FontAttributes Constructor
 Creates a new font attributes instance. The default color is black, the height is 2.5, the font name is Arial and the values of italic and bold are false.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public FontAttributes()
Public Sub New
See Also
Reference
FontAttributes Class
FontAttributes Overload
Tekla.Structures.Drawing Namespace